Revit 2027 API
BuiltInFailures.SteelElementFailures.SteelElementPropagationTaskNotFinished Property
 Advance Steel propagation tasks not finished.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SteelElementPropagationTaskNotFinished { get; }
Public Shared ReadOnly Property SteelElementPropagationTaskNotFinished As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SteelElementPropagationTaskNotFinished {
	FailureDefinitionId^ get ();
}
static member SteelElementPropagationTaskNotFinished : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SteelElementFailures Class
Autodesk.Revit.DB Namespace